tests/TestData/StripeWebhook/ApiResponse/bt_success.json

{
  "id": "txn_00000000000000",
  "object": "balance_transaction",
  "amount": 600,
  "available_on": 1595203200,
  "created": 1594646323,
  "currency": "gbp",
  "description": null,
  "exchange_rate": null,
  "fee": 37,
  "fee_details": [
    {
      "amount": 37,
      "application": null,
      "currency": "gbp",
      "description": "Stripe processing fees",
      "type": "stripe_fee"
    }
  ],
  "net": 563,
  "reporting_category": "charge",
  "source": "ch_externalId_123",
  "status": "available",
  "type": "charge"
}
