tests/TestData/StripeWebhook/ch_succeeded.json

{
  "_comment": "Timestamp below is Tue Mar 18 2025 14:30:01 GMT+0000",
  "created": 1742308201,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "charge.succeeded",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2022-08-01",
  "data": {
    "object": {
      "id": "ch_externalId_123",
      "object": "charge",
      "amount": 600,
      "amount_refunded": 0,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_00000000000000",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": "10982",
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "calculated_statement_descriptor": "THE BIG GIVE",
      "captured": true,
      "created": 1742308201,
      "currency": "gbp",
      "customer": null,
      "description": null,
      "disputed": false,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {
      },
      "invoice": null,
      "livemode": false,
      "metadata": {
      },
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 28,
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": "pi_externalId_123",
      "payment_method": "pm_00000000000000",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": "pass",
            "cvc_check": "pass"
          },
          "country": "US",
          "exp_month": 4,
          "exp_year": 2021,
          "fingerprint": "VjX3hQtxtQb5gge8",
          "funding": "credit",
          "installments": null,
          "last4": "4242",
          "network": "visa",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/acct_1GxbdTKkGuKkxwBN/ch_1H4RYNKkGuKkxwBNnN1khhoF/rcpt_Hdj08tPMJjxYYcTMieYHZlBQDDYk3A6",
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "url": "/v1/charges/ch_1H4RYNKkGuKkxwBNnN1khhoF/refunds"
      },
      "review": null,
      "shipping": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "__comment": "There may be a 'transfer' key, especially outside prod, but we should not rely on it being present in a response to an async confirm request",
      "transfer_data": null,
      "transfer_group": null
    }
  }
}
